piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/inc/MDR32VF0xI_rst_clk.h
/**
 *******************************************************************************
 * @file    MDR32VF0xI_rst_clk.h
 * @author  Milandr Application Team
 * @version V0.2.0
 * @date    07/05/2025
 * @brief   This file contains all the functions prototypes for the RST_CLK
 *          firmware library.
 *******************************************************************************
 * <br><br>
 *
 * THE PRESENT FIRMWARE IS FOR GUIDANCE ONLY. IT AIMS AT PROVIDING CUSTOMERS
 * WITH CODING INFORMATION REGARDING MILANDR'S PRODUCTS IN ORDER TO FACILITATE
 * THE USE AND SAVE TIME. MILANDR SHALL NOT BE HELD LIABLE FOR ANY
 * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES RESULTING
 * FROM THE CONTENT OF SUCH FIRMWARE AND/OR A USE MADE BY CUSTOMERS OF THE
 * CODING INFORMATION CONTAINED HEREIN IN THEIR PRODUCTS.
 *
 * <h2><center>&copy; COPYRIGHT 2025 Milandr</center></h2>
 *******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef MDR32VF0xI_RST_CLK_H
#define MDR32VF0xI_RST_CLK_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "MDR32VF0xI_config.h"

/** @addtogroup MDR32VF0xI_StdPeriph_Driver MDR32VF0xI Standard Peripheral Driver
 * @{
 */

/** @addtogroup RST_CLK
 * @{
 */

/** @defgroup RST_CLK_Exported_Types RST_CLK Exported Types
 * @{
 */

/**
 * @brief RST_CLK HSE (High Speed External) clock mode and source selection constants.
 */
typedef enum {
    RST_CLK_HSE_OFF    = ((uint32_t)0x0),                                         /*!< Switch off the HSE clock generator. */
    RST_CLK_HSE_ON     = RST_CLK_HS_CONTROL_HSE_ON,                               /*!< Switch on the HSE clock generator. */
    RST_CLK_HSE_BYPASS = (RST_CLK_HS_CONTROL_HSE_ON | RST_CLK_HS_CONTROL_HSE_BYP) /*!< Use an external clock source. */
} RST_CLK_HSE_Mode_TypeDef;

#define IS_RST_CLK_HSE(HSE) (((HSE) == RST_CLK_HSE_OFF) || \
                             ((HSE) == RST_CLK_HSE_ON) ||  \
                             ((HSE) == RST_CLK_HSE_BYPASS))

/**
 * @brief RST_CLK CPU_PLL clock source selection constants.
 */
typedef enum {
    RST_CLK_PLLCPU_CLK_SRC_HSE    = ((uint32_t)0),
    RST_CLK_PLLCPU_CLK_SRC_CPU_C1 = ((uint32_t)RST_CLK_PLL_CONTROL_PLL_CPU_SEL)
} RST_CLK_PLLCPU_ClockSource_TypeDef;

#define IS_RST_CLK_PLLCPU_CLOCK_SOURCE(CLK) (((CLK) == RST_CLK_PLLCPU_CLK_SRC_HSE) || \
                                             ((CLK) == RST_CLK_PLLCPU_CLK_SRC_CPU_C1))

/**
 * @brief RST_CLK CPU_C1 clock source selection constants.
 */
typedef enum {
    RST_CLK_CPU_C1_CLK_SRC_HSI       = ((uint32_t)RST_CLK_CPU_CLOCK_CPU_C1_SEL_HSI),       /*!< HSI as the CPU_C1 source. */
    RST_CLK_CPU_C1_CLK_SRC_HSI_DIV_2 = ((uint32_t)RST_CLK_CPU_CLOCK_CPU_C1_SEL_HSI_DIV_2), /*!< HSI/2 as the CPU_C1 source. */
    RST_CLK_CPU_C1_CLK_SRC_HSE       = ((uint32_t)RST_CLK_CPU_CLOCK_CPU_C1_SEL_HSE),       /*!< HSE as the CPU_C1 source. */
    RST_CLK_CPU_C1_CLK_SRC_HSE_DIV_2 = ((uint32_t)RST_CLK_CPU_CLOCK_CPU_C1_SEL_HSE_DIV_2)  /*!< HSE/2 as the CPU_C1 source. */
} RST_CLK_CPU_C1_ClockSource_TypeDef;

#define IS_RST_CLK_CPU_C1_CLOCK_SOURCE(CLK) (((CLK) == RST_CLK_CPU_C1_CLK_SRC_HSI) ||       \
                                             ((CLK) == RST_CLK_CPU_C1_CLK_SRC_HSI_DIV_2) || \
                                             ((CLK) == RST_CLK_CPU_C1_CLK_SRC_HSE) ||       \
                                             ((CLK) == RST_CLK_CPU_C1_CLK_SRC_HSE_DIV_2))

/**
 * @brief RST_CLK PLL_CPU_MUL multiplier constants.
 */
typedef enum {
    RST_CLK_PLLCPU_MUL_1 = ((uint32_t)0x0),
    RST_CLK_PLLCPU_MUL_2 = ((uint32_t)0x1),
    RST_CLK_PLLCPU_MUL_3 = ((uint32_t)0x2),
    RST_CLK_PLLCPU_MUL_4 = ((uint32_t)0x3),
    RST_CLK_PLLCPU_MUL_5 = ((uint32_t)0x4),
    RST_CLK_PLLCPU_MUL_6 = ((uint32_t)0x5),
    RST_CLK_PLLCPU_MUL_7 = ((uint32_t)0x6),
    RST_CLK_PLLCPU_MUL_8 = ((uint32_t)0x7)
} RST_CLK_PLLCPU_Multiplier_TypeDef;

#define IS_RST_CLK_PLLCPU_MUL(MUL) (((MUL) & ~((uint32_t)0x7)) == 0x0)

/**
 * @brief RST_CLK CPU_C2 clock source selection constants.
 */
typedef enum {
    RST_CLK_CPU_C2_CLK_SRC_CPU_C1 = (((uint32_t)0x0) << RST_CLK_CPU_CLOCK_CPU_C2_SEL_Pos), /*!< CPU_C1 as CPU_C2 source. */
    RST_CLK_CPU_C2_CLK_SRC_PLLCPU = (((uint32_t)0x1) << RST_CLK_CPU_CLOCK_CPU_C2_SEL_Pos)  /*!< CPU_PLL as CPU_C2 source. */
} RST_CLK_CPU_C2_ClockSource_TypeDef;

#define IS_RST_CLK_CPU_C2_CLOCK_SOURCE(CLK) (((CLK) == RST_CLK_CPU_C2_CLK_SRC_CPU_C1) || \
                                             ((CLK) == RST_CLK_CPU_C2_CLK_SRC_PLLCPU))

/**
 * @brief RST_CLK CPU_C3 divider constants.
 */
typedef enum {
    RST_CLK_CPU_C3_PRESCALER_DIV_1   = (((uint32_t)0x0) << RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos),
    RST_CLK_CPU_C3_PRESCALER_DIV_2   = (((uint32_t)0x8) << RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos),
    RST_CLK_CPU_C3_PRESCALER_DIV_4   = (((uint32_t)0x9) << RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos),
    RST_CLK_CPU_C3_PRESCALER_DIV_8   = (((uint32_t)0xA) << RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos),
    RST_CLK_CPU_C3_PRESCALER_DIV_16  = (((uint32_t)0xB) << RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos),
    RST_CLK_CPU_C3_PRESCALER_DIV_32  = (((uint32_t)0xC) << RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos),
    RST_CLK_CPU_C3_PRESCALER_DIV_64  = (((uint32_t)0xD) << RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos),
    RST_CLK_CPU_C3_PRESCALER_DIV_128 = (((uint32_t)0xE) << RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos),
    RST_CLK_CPU_C3_PRESCALER_DIV_256 = (((uint32_t)0xF) << RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos)
} RST_CLK_CPU_C3_Prescaler_TypeDef;

#define IS_RST_CLK_CPU_C3_DIV(DIV) (((DIV) == RST_CLK_CPU_C3_PRESCALER_DIV_1) ||   \
                                    ((DIV) == RST_CLK_CPU_C3_PRESCALER_DIV_2) ||   \
                                    ((DIV) == RST_CLK_CPU_C3_PRESCALER_DIV_4) ||   \
                                    ((DIV) == RST_CLK_CPU_C3_PRESCALER_DIV_8) ||   \
                                    ((DIV) == RST_CLK_CPU_C3_PRESCALER_DIV_16) ||  \
                                    ((DIV) == RST_CLK_CPU_C3_PRESCALER_DIV_32) ||  \
                                    ((DIV) == RST_CLK_CPU_C3_PRESCALER_DIV_64) ||  \
                                    ((DIV) == RST_CLK_CPU_C3_PRESCALER_DIV_128) || \
                                    ((DIV) == RST_CLK_CPU_C3_PRESCALER_DIV_256))

/**
 * @brief RST_CLK HCLK clock source selection constants.
 */
typedef enum {
    RST_CLK_CPU_HCLK_CLK_SRC_HSI    = ((uint32_t)RST_CLK_CPU_CLOCK_HCLK_SEL_HSI),
    RST_CLK_CPU_HCLK_CLK_SRC_CPU_C3 = ((uint32_t)RST_CLK_CPU_CLOCK_HCLK_SEL_CPU_C3),
    RST_CLK_CPU_HCLK_CLK_SRC_LSE    = ((uint32_t)RST_CLK_CPU_CLOCK_HCLK_SEL_LSE),
    RST_CLK_CPU_HCLK_CLK_SRC_LSI    = ((uint32_t)RST_CLK_CPU_CLOCK_HCLK_SEL_LSI)
} RST_CLK_HCLK_ClockSource_TypeDef;

#define IS_RST_CLK_HCLK_CLOCK_SOURCE(CLK) (((CLK) == RST_CLK_CPU_HCLK_CLK_SRC_HSI) ||    \
                                           ((CLK) == RST_CLK_CPU_HCLK_CLK_SRC_CPU_C3) || \
                                           ((CLK) == RST_CLK_CPU_HCLK_CLK_SRC_LSE) ||    \
                                           ((CLK) == RST_CLK_CPU_HCLK_CLK_SRC_LSI))

/**
 * @brief RST_CLK ADC_CLK clock source selection constants.
 */
typedef enum {
    RST_CLK_ADC_CLK_SRC_CPU_C1     = ((uint32_t)RST_CLK_ADC_CLOCK_ADC_C1_SEL_CPU_C1),
    RST_CLK_ADC_CLK_SRC_PER1_C1    = ((uint32_t)RST_CLK_ADC_CLOCK_ADC_C1_SEL_PER1_C1),
    RST_CLK_ADC_CLK_SRC_PLLCPU     = ((uint32_t)RST_CLK_ADC_CLOCK_ADC_C1_SEL_PLLCPU),
    RST_CLK_ADC_CLK_SRC_HSE_C1_CLK = ((uint32_t)RST_CLK_ADC_CLOCK_ADC_C1_SEL_HSE_C1_CLK)
} RST_CLK_ADC_ClockSource_TypeDef;

#define IS_RST_CLK_ADC_CLOCK_SOURCE(CLK) (((CLK) == RST_CLK_ADC_CLK_SRC_CPU_C1) ||  \
                                          ((CLK) == RST_CLK_ADC_CLK_SRC_PER1_C1) || \
                                          ((CLK) == RST_CLK_ADC_CLK_SRC_PLLCPU) ||  \
                                          ((CLK) == RST_CLK_ADC_CLK_SRC_HSE_C1_CLK))

/**
 * @brief RST_CLK ADC_C3_SEL divider constants.
 */
typedef enum {
    RST_CLK_ADC_PRESCALER_DIV_1   = (((uint32_t)0x0) << RST_CLK_ADC_CLOCK_ADC_C3_SEL_Pos),
    RST_CLK_ADC_PRESCALER_DIV_2   = (((uint32_t)0x8) << RST_CLK_ADC_CLOCK_ADC_C3_SEL_Pos),
    RST_CLK_ADC_PRESCALER_DIV_4   = (((uint32_t)0x9) << RST_CLK_ADC_CLOCK_ADC_C3_SEL_Pos),
    RST_CLK_ADC_PRESCALER_DIV_8   = (((uint32_t)0xA) << RST_CLK_ADC_CLOCK_ADC_C3_SEL_Pos),
    RST_CLK_ADC_PRESCALER_DIV_16  = (((uint32_t)0xB) << RST_CLK_ADC_CLOCK_ADC_C3_SEL_Pos),
    RST_CLK_ADC_PRESCALER_DIV_32  = (((uint32_t)0xC) << RST_CLK_ADC_CLOCK_ADC_C3_SEL_Pos),
    RST_CLK_ADC_PRESCALER_DIV_64  = (((uint32_t)0xD) << RST_CLK_ADC_CLOCK_ADC_C3_SEL_Pos),
    RST_CLK_ADC_PRESCALER_DIV_128 = (((uint32_t)0xE) << RST_CLK_ADC_CLOCK_ADC_C3_SEL_Pos),
    RST_CLK_ADC_PRESCALER_DIV_256 = (((uint32_t)0xF) << RST_CLK_ADC_CLOCK_ADC_C3_SEL_Pos)
} RST_CLK_ADC_C3_Prescaler_TypeDef;

#define IS_RST_CLK_ADC_C3_DIV(DIV) (((DIV) == RST_CLK_ADC_PRESCALER_DIV_1) ||   \
                                    ((DIV) == RST_CLK_ADC_PRESCALER_DIV_2) ||   \
                                    ((DIV) == RST_CLK_ADC_PRESCALER_DIV_4) ||   \
                                    ((DIV) == RST_CLK_ADC_PRESCALER_DIV_8) ||   \
                                    ((DIV) == RST_CLK_ADC_PRESCALER_DIV_16) ||  \
                                    ((DIV) == RST_CLK_ADC_PRESCALER_DIV_32) ||  \
                                    ((DIV) == RST_CLK_ADC_PRESCALER_DIV_64) ||  \
                                    ((DIV) == RST_CLK_ADC_PRESCALER_DIV_128) || \
                                    ((DIV) == RST_CLK_ADC_PRESCALER_DIV_256))

/**
 * @brief RST_CLK ADCUI_CLK clock source selection constants.
 */
typedef enum {
    RST_CLK_ADCUI_CLK_SRC_CPU_C1     = ((uint32_t)RST_CLK_ADC_CLOCK_ADCUI_C1_SEL_CPU_C1),
    RST_CLK_ADCUI_CLK_SRC_PER1_C1    = ((uint32_t)RST_CLK_ADC_CLOCK_ADCUI_C1_SEL_PER1_C1),
    RST_CLK_ADCUI_CLK_SRC_PLLCPU     = ((uint32_t)RST_CLK_ADC_CLOCK_ADCUI_C1_SEL_PLLCPU),
    RST_CLK_ADCUI_CLK_SRC_HSE_C1_CLK = ((uint32_t)RST_CLK_ADC_CLOCK_ADCUI_C1_SEL_HSE_C1_CLK)
} RST_CLK_ADCUI_ClockSource_TypeDef;

#define IS_RST_CLK_ADCUI_CLOCK_SOURCE(CLK) (((CLK) == RST_CLK_ADCUI_CLK_SRC_CPU_C1) ||  \
                                            ((CLK) == RST_CLK_ADCUI_CLK_SRC_PER1_C1) || \
                                            ((CLK) == RST_CLK_ADCUI_CLK_SRC_PLLCPU) ||  \
                                            ((CLK) == RST_CLK_ADCUI_CLK_SRC_HSE_C1_CLK))

/**
 * @brief RST_CLK ADCUI_C3_SEL divider constants.
 */
typedef enum {
    RST_CLK_ADCUI_PRESCALER_DIV_1   = (((uint32_t)0x0) << RST_CLK_ADC_CLOCK_ADCUI_C3_SEL_Pos),
    RST_CLK_ADCUI_PRESCALER_DIV_2   = (((uint32_t)0x8) << RST_CLK_ADC_CLOCK_ADCUI_C3_SEL_Pos),
    RST_CLK_ADCUI_PRESCALER_DIV_4   = (((uint32_t)0x9) << RST_CLK_ADC_CLOCK_ADCUI_C3_SEL_Pos),
    RST_CLK_ADCUI_PRESCALER_DIV_8   = (((uint32_t)0xA) << RST_CLK_ADC_CLOCK_ADCUI_C3_SEL_Pos),
    RST_CLK_ADCUI_PRESCALER_DIV_16  = (((uint32_t)0xB) << RST_CLK_ADC_CLOCK_ADCUI_C3_SEL_Pos),
    RST_CLK_ADCUI_PRESCALER_DIV_32  = (((uint32_t)0xC) << RST_CLK_ADC_CLOCK_ADCUI_C3_SEL_Pos),
    RST_CLK_ADCUI_PRESCALER_DIV_64  = (((uint32_t)0xD) << RST_CLK_ADC_CLOCK_ADCUI_C3_SEL_Pos),
    RST_CLK_ADCUI_PRESCALER_DIV_128 = (((uint32_t)0xE) << RST_CLK_ADC_CLOCK_ADCUI_C3_SEL_Pos),
    RST_CLK_ADCUI_PRESCALER_DIV_256 = (((uint32_t)0xF) << RST_CLK_ADC_CLOCK_ADCUI_C3_SEL_Pos)
} RST_CLK_ADCUI_C3_Prescaler_TypeDef;

#define IS_RST_CLK_ADCUI_C3_DIV(DIV) (((DIV) == RST_CLK_ADCUI_PRESCALER_DIV_1) ||   \
                                      ((DIV) == RST_CLK_ADCUI_PRESCALER_DIV_2) ||   \
                                      ((DIV) == RST_CLK_ADCUI_PRESCALER_DIV_4) ||   \
                                      ((DIV) == RST_CLK_ADCUI_PRESCALER_DIV_8) ||   \
                                      ((DIV) == RST_CLK_ADCUI_PRESCALER_DIV_16) ||  \
                                      ((DIV) == RST_CLK_ADCUI_PRESCALER_DIV_32) ||  \
                                      ((DIV) == RST_CLK_ADCUI_PRESCALER_DIV_64) ||  \
                                      ((DIV) == RST_CLK_ADCUI_PRESCALER_DIV_128) || \
                                      ((DIV) == RST_CLK_ADCUI_PRESCALER_DIV_256))

/**
 * @brief RST_CLK peripheral modules clock constants.
 */
typedef enum {
    RST_CLK_PCLK_SSP1    = RST_CLK_PER2_CLOCK_PCLK_EN_SSP1,
    RST_CLK_PCLK_UART1   = RST_CLK_PER2_CLOCK_PCLK_EN_UART1,
    RST_CLK_PCLK_UART2   = RST_CLK_PER2_CLOCK_PCLK_EN_UART2,
    RST_CLK_PCLK_FLASH   = RST_CLK_PER2_CLOCK_PCLK_EN_FLASH,
    RST_CLK_PCLK_RST_CLK = RST_CLK_PER2_CLOCK_PCLK_EN_RST_CLK,
    RST_CLK_PCLK_DMA     = RST_CLK_PER2_CLOCK_PCLK_EN_DMA,
    RST_CLK_PCLK_I2C     = RST_CLK_PER2_CLOCK_PCLK_EN_I2C,
    RST_CLK_PCLK_UART3   = RST_CLK_PER2_CLOCK_PCLK_EN_UART3,
    RST_CLK_PCLK_ADC     = RST_CLK_PER2_CLOCK_PCLK_EN_ADC,
    RST_CLK_PCLK_WWDG    = RST_CLK_PER2_CLOCK_PCLK_EN_WWDG,
    RST_CLK_PCLK_IWDG    = RST_CLK_PER2_CLOCK_PCLK_EN_IWDG,
    RST_CLK_PCLK_POWER   = RST_CLK_PER2_CLOCK_PCLK_EN_POWER,
    RST_CLK_PCLK_BKP     = RST_CLK_PER2_CLOCK_PCLK_EN_BKP,
    RST_CLK_PCLK_ADCUI   = RST_CLK_PER2_CLOCK_PCLK_EN_ADCUI,
    RST_CLK_PCLK_TIMER1  = RST_CLK_PER2_CLOCK_PCLK_EN_TIMER1,
    RST_CLK_PCLK_TIMER2  = RST_CLK_PER2_CLOCK_PCLK_EN_TIMER2,
    RST_CLK_PCLK_PORTA   = RST_CLK_PER2_CLOCK_PCLK_EN_PORTA,
    RST_CLK_PCLK_PORTB   = RST_CLK_PER2_CLOCK_PCLK_EN_PORTB,
    RST_CLK_PCLK_PORTC   = RST_CLK_PER2_CLOCK_PCLK_EN_PORTC,
    RST_CLK_PCLK_CRC     = RST_CLK_PER2_CLOCK_PCLK_EN_CRC,
#if defined(USE_MDR32F02)
    RST_CLK_PCLK_SENSORS     = RST_CLK_PER2_CLOCK_PCLK_EN_SENSORS,
    RST_CLK_PCLK_CLK_MEASURE = RST_CLK_PER2_CLOCK_PCLK_EN_CLR_MEASURE,
#endif
    RST_CLK_PCLK_RANDOM = RST_CLK_PER2_CLOCK_PCLK_EN_RANDOM,
    RST_CLK_PCLK_USART  = RST_CLK_PER2_CLOCK_PCLK_EN_ISO7816,
    RST_CLK_PCLK_SSP2   = RST_CLK_PER2_CLOCK_PCLK_EN_SSP2,
    RST_CLK_PCLK_SSP3   = RST_CLK_PER2_CLOCK_PCLK_EN_SSP3,
    RST_CLK_PCLK_TIMER3 = RST_CLK_PER2_CLOCK_PCLK_EN_TIMER3,
    RST_CLK_PCLK_TIMER4 = RST_CLK_PER2_CLOCK_PCLK_EN_TIMER4,
    RST_CLK_PCLK_UART4  = RST_CLK_PER2_CLOCK_PCLK_EN_UART4,
    RST_CLK_PCLK_PORTD  = RST_CLK_PER2_CLOCK_PCLK_EN_PORTD
} RST_CLK_PCLK_TypeDef;

