piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/inc/MDR32VF0xI_rst_clk.h
#if defined(USE_MDR32F02)

#define IS_RST_CLK_PCLK(PCLK) (((PCLK) == RST_CLK_PCLK_SSP1) ||        \
                               ((PCLK) == RST_CLK_PCLK_UART1) ||       \
                               ((PCLK) == RST_CLK_PCLK_UART2) ||       \
                               ((PCLK) == RST_CLK_PCLK_FLASH) ||       \
                               ((PCLK) == RST_CLK_PCLK_RST_CLK) ||     \
                               ((PCLK) == RST_CLK_PCLK_DMA) ||         \
                               ((PCLK) == RST_CLK_PCLK_I2C) ||         \
                               ((PCLK) == RST_CLK_PCLK_UART3) ||       \
                               ((PCLK) == RST_CLK_PCLK_ADC) ||         \
                               ((PCLK) == RST_CLK_PCLK_WWDG) ||        \
                               ((PCLK) == RST_CLK_PCLK_IWDG) ||        \
                               ((PCLK) == RST_CLK_PCLK_POWER) ||       \
                               ((PCLK) == RST_CLK_PCLK_BKP) ||         \
                               ((PCLK) == RST_CLK_PCLK_ADCUI) ||       \
                               ((PCLK) == RST_CLK_PCLK_TIMER1) ||      \
                               ((PCLK) == RST_CLK_PCLK_TIMER2) ||      \
                               ((PCLK) == RST_CLK_PCLK_PORTA) ||       \
                               ((PCLK) == RST_CLK_PCLK_PORTB) ||       \
                               ((PCLK) == RST_CLK_PCLK_PORTC) ||       \
                               ((PCLK) == RST_CLK_PCLK_CRC) ||         \
                               ((PCLK) == RST_CLK_PCLK_SENSORS) ||     \
                               ((PCLK) == RST_CLK_PCLK_CLK_MEASURE) || \
                               ((PCLK) == RST_CLK_PCLK_RANDOM) ||      \
                               ((PCLK) == RST_CLK_PCLK_USART) ||       \
                               ((PCLK) == RST_CLK_PCLK_SSP2) ||        \
                               ((PCLK) == RST_CLK_PCLK_SSP3) ||        \
                               ((PCLK) == RST_CLK_PCLK_TIMER3) ||      \
                               ((PCLK) == RST_CLK_PCLK_TIMER4) ||      \
                               ((PCLK) == RST_CLK_PCLK_UART4) ||       \
                               ((PCLK) == RST_CLK_PCLK_PORTD))

#define RST_CLK_PCLK_MASK (RST_CLK_PCLK_SSP1 | RST_CLK_PCLK_UART1 |          \
                           RST_CLK_PCLK_UART2 | RST_CLK_PCLK_FLASH |         \
                           RST_CLK_PCLK_RST_CLK | RST_CLK_PCLK_DMA |         \
                           RST_CLK_PCLK_I2C | RST_CLK_PCLK_UART3 |           \
                           RST_CLK_PCLK_ADC | RST_CLK_PCLK_WWDG |            \
                           RST_CLK_PCLK_IWDG | RST_CLK_PCLK_POWER |          \
                           RST_CLK_PCLK_BKP | RST_CLK_PCLK_ADCUI |           \
                           RST_CLK_PCLK_TIMER1 | RST_CLK_PCLK_TIMER2 |       \
                           RST_CLK_PCLK_PORTA | RST_CLK_PCLK_PORTB |         \
                           RST_CLK_PCLK_PORTC | RST_CLK_PCLK_CRC |           \
                           RST_CLK_PCLK_SENSORS | RST_CLK_PCLK_CLK_MEASURE | \
                           RST_CLK_PCLK_RANDOM | RST_CLK_PCLK_USART |        \
                           RST_CLK_PCLK_SSP2 | RST_CLK_PCLK_SSP3 |           \
                           RST_CLK_PCLK_TIMER3 | RST_CLK_PCLK_TIMER4 |       \
                           RST_CLK_PCLK_UART4 | RST_CLK_PCLK_PORTD)

#elif defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)

#define IS_RST_CLK_PCLK(PCLK) (((PCLK) == RST_CLK_PCLK_SSP1) ||    \
                               ((PCLK) == RST_CLK_PCLK_UART1) ||   \
                               ((PCLK) == RST_CLK_PCLK_UART2) ||   \
                               ((PCLK) == RST_CLK_PCLK_FLASH) ||   \
                               ((PCLK) == RST_CLK_PCLK_RST_CLK) || \
                               ((PCLK) == RST_CLK_PCLK_DMA) ||     \
                               ((PCLK) == RST_CLK_PCLK_I2C) ||     \
                               ((PCLK) == RST_CLK_PCLK_UART3) ||   \
                               ((PCLK) == RST_CLK_PCLK_ADC) ||     \
                               ((PCLK) == RST_CLK_PCLK_WWDG) ||    \
                               ((PCLK) == RST_CLK_PCLK_IWDG) ||    \
                               ((PCLK) == RST_CLK_PCLK_POWER) ||   \
                               ((PCLK) == RST_CLK_PCLK_BKP) ||     \
                               ((PCLK) == RST_CLK_PCLK_ADCUI) ||   \
                               ((PCLK) == RST_CLK_PCLK_TIMER1) ||  \
                               ((PCLK) == RST_CLK_PCLK_TIMER2) ||  \
                               ((PCLK) == RST_CLK_PCLK_PORTA) ||   \
                               ((PCLK) == RST_CLK_PCLK_PORTB) ||   \
                               ((PCLK) == RST_CLK_PCLK_PORTC) ||   \
                               ((PCLK) == RST_CLK_PCLK_CRC) ||     \
                               ((PCLK) == RST_CLK_PCLK_RANDOM) ||  \
                               ((PCLK) == RST_CLK_PCLK_USART) ||   \
                               ((PCLK) == RST_CLK_PCLK_SSP2) ||    \
                               ((PCLK) == RST_CLK_PCLK_SSP3) ||    \
                               ((PCLK) == RST_CLK_PCLK_TIMER3) ||  \
                               ((PCLK) == RST_CLK_PCLK_TIMER4) ||  \
                               ((PCLK) == RST_CLK_PCLK_UART4) ||   \
                               ((PCLK) == RST_CLK_PCLK_PORTD))

#define RST_CLK_PCLK_MASK (RST_CLK_PCLK_SSP1 | RST_CLK_PCLK_UART1 |    \
                           RST_CLK_PCLK_UART2 | RST_CLK_PCLK_FLASH |   \
                           RST_CLK_PCLK_RST_CLK | RST_CLK_PCLK_DMA |   \
                           RST_CLK_PCLK_I2C | RST_CLK_PCLK_UART3 |     \
                           RST_CLK_PCLK_ADC | RST_CLK_PCLK_WWDG |      \
                           RST_CLK_PCLK_IWDG | RST_CLK_PCLK_POWER |    \
                           RST_CLK_PCLK_BKP | RST_CLK_PCLK_ADCUI |     \
                           RST_CLK_PCLK_TIMER1 | RST_CLK_PCLK_TIMER2 | \
                           RST_CLK_PCLK_PORTA | RST_CLK_PCLK_PORTB |   \
                           RST_CLK_PCLK_PORTC | RST_CLK_PCLK_CRC |     \
                           RST_CLK_PCLK_RANDOM | RST_CLK_PCLK_USART |  \
                           RST_CLK_PCLK_SSP2 | RST_CLK_PCLK_SSP3 |     \
                           RST_CLK_PCLK_TIMER3 | RST_CLK_PCLK_TIMER4 | \
                           RST_CLK_PCLK_UART4 | RST_CLK_PCLK_PORTD)

#endif

