piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/inc/MDR32VF0xI_rst_clk.h
#define IS_RST_CLK_PCLKS(PCLK) (((PCLK) & RST_CLK_PCLK_MASK) == (PCLK))

/**
 * @brief RST_CLK PER1_C1 clock source selection constants.
 */
typedef enum {
    RST_CLK_PER1_C1_CLK_SRC_LSI       = ((uint32_t)RST_CLK_PER1_CLOCK_PER1_C1_SEL_LSI),
    RST_CLK_PER1_C1_CLK_SRC_LSI_DIV_2 = ((uint32_t)RST_CLK_PER1_CLOCK_PER1_C1_SEL_LSI_DIV_2),
    RST_CLK_PER1_C1_CLK_SRC_LSE       = ((uint32_t)RST_CLK_PER1_CLOCK_PER1_C1_SEL_LSE),
    RST_CLK_PER1_C1_CLK_SRC_LSE_DIV_2 = ((uint32_t)RST_CLK_PER1_CLOCK_PER1_C1_SEL_LSE_DIV_2)
} RST_CLK_PER1_C1_ClockSource_TypeDef;

#define IS_RST_CLK_PER1_C1_CLOCK_SOURCE(CLK) (((CLK) == RST_CLK_PER1_C1_CLK_SRC_LSI) ||       \
                                              ((CLK) == RST_CLK_PER1_C1_CLK_SRC_LSI_DIV_2) || \
                                              ((CLK) == RST_CLK_PER1_C1_CLK_SRC_LSE) ||       \
                                              ((CLK) == RST_CLK_PER1_C1_CLK_SRC_LSE_DIV_2))

/**
 * @brief RST_CLK PER1_C2 clock source selection constants.
 */
typedef enum {
    RST_CLK_PER1_C2_CLK_SRC_CPU_C1     = ((uint32_t)RST_CLK_PER1_CLOCK_PER1_C2_SEL_CPU_C1),
    RST_CLK_PER1_C2_CLK_SRC_PER1_C1    = ((uint32_t)RST_CLK_PER1_CLOCK_PER1_C2_SEL_PER1_C1),
    RST_CLK_PER1_C2_CLK_SRC_PLLCPU     = ((uint32_t)RST_CLK_PER1_CLOCK_PER1_C2_SEL_PLLCPU),
    RST_CLK_PER1_C2_CLK_SRC_HSI_C1_CLK = ((uint32_t)RST_CLK_PER1_CLOCK_PER1_C2_SEL_HSI_C1_CLK)
} RST_CLK_PER1_C2_ClockSource_TypeDef;

#define IS_RST_CLK_PER1_C2_CLOCK_SOURCE(CLK) (((CLK) == RST_CLK_PER1_C2_CLK_SRC_CPU_C1) ||  \
                                              ((CLK) == RST_CLK_PER1_C2_CLK_SRC_PER1_C1) || \
                                              ((CLK) == RST_CLK_PER1_C2_CLK_SRC_PLLCPU) ||  \
                                              ((CLK) == RST_CLK_PER1_C2_CLK_SRC_HSI_C1_CLK))

/**
 * @brief RST_CLK PER1 peripheral selection constants.
 */
typedef enum {
    RST_CLK_PER1_C2_UART1 = ((uint32_t)0x1 << 0),
    RST_CLK_PER1_C2_UART2 = ((uint32_t)0x1 << 1),
    RST_CLK_PER1_C2_UART3 = ((uint32_t)0x1 << 2),
    RST_CLK_PER1_C2_UART4 = ((uint32_t)0x1 << 6),
    RST_CLK_PER1_C2_TIM1  = ((uint32_t)0x1 << 7),
    RST_CLK_PER1_C2_TIM2  = ((uint32_t)0x1 << 8),
    RST_CLK_PER1_C2_TIM3  = ((uint32_t)0x1 << 9),
    RST_CLK_PER1_C2_TIM4  = ((uint32_t)0x1 << 10),
    RST_CLK_PER1_C2_SSP1  = ((uint32_t)0x1 << 11),
    RST_CLK_PER1_C2_SSP2  = ((uint32_t)0x1 << 12),
    RST_CLK_PER1_C2_SSP3  = ((uint32_t)0x1 << 13)
} RST_CLK_PER1_C2_X_TypeDef;

#define IS_RST_CLK_PER1_CLK(PER1_CLK) (((PER1_CLK) == RST_CLK_PER1_C2_UART1) || \
                                       ((PER1_CLK) == RST_CLK_PER1_C2_UART2) || \
                                       ((PER1_CLK) == RST_CLK_PER1_C2_UART3) || \
                                       ((PER1_CLK) == RST_CLK_PER1_C2_UART4) || \
                                       ((PER1_CLK) == RST_CLK_PER1_C2_TIM1) ||  \
                                       ((PER1_CLK) == RST_CLK_PER1_C2_TIM2) ||  \
                                       ((PER1_CLK) == RST_CLK_PER1_C2_TIM3) ||  \
                                       ((PER1_CLK) == RST_CLK_PER1_C2_TIM4) ||  \
                                       ((PER1_CLK) == RST_CLK_PER1_C2_SSP1) ||  \
                                       ((PER1_CLK) == RST_CLK_PER1_C2_SSP2) ||  \
                                       ((PER1_CLK) == RST_CLK_PER1_C2_SSP3))

#define RST_CLK_PER1_CLK_UART_MASK (uint32_t)(RST_CLK_PER1_C2_UART1 | \
                                              RST_CLK_PER1_C2_UART2 | \
                                              RST_CLK_PER1_C2_UART3 | \
                                              RST_CLK_PER1_C2_UART4)

#define RST_CLK_PER1_CLK_TIM_MASK (uint32_t)(RST_CLK_PER1_C2_TIM1 | \
                                             RST_CLK_PER1_C2_TIM2 | \
                                             RST_CLK_PER1_C2_TIM3 | \
                                             RST_CLK_PER1_C2_TIM4)

#define RST_CLK_PER1_CLK_SSP_MASK (uint32_t)(RST_CLK_PER1_C2_SSP1 | \
                                             RST_CLK_PER1_C2_SSP2 | \
                                             RST_CLK_PER1_C2_SSP3)

#define IS_RST_CLK_PER1_CLKS(PER1_CLKS) (((PER1_CLKS) & ~(RST_CLK_PER1_CLK_UART_MASK | \
                                                          RST_CLK_PER1_CLK_TIM_MASK |  \
                                                          RST_CLK_PER1_CLK_SSP_MASK)) == 0x0)

/**
 * @brief RST_CLK PER1_C2 divider constants.
 */
typedef enum {
    RST_CLK_PER1_PRESCALER_DIV_1   = ((uint32_t)0x0),
    RST_CLK_PER1_PRESCALER_DIV_2   = ((uint32_t)0x1),
    RST_CLK_PER1_PRESCALER_DIV_4   = ((uint32_t)0x2),
    RST_CLK_PER1_PRESCALER_DIV_8   = ((uint32_t)0x3),
    RST_CLK_PER1_PRESCALER_DIV_16  = ((uint32_t)0x4),
    RST_CLK_PER1_PRESCALER_DIV_32  = ((uint32_t)0x5),
    RST_CLK_PER1_PRESCALER_DIV_64  = ((uint32_t)0x6),
    RST_CLK_PER1_PRESCALER_DIV_128 = ((uint32_t)0x7)
} RST_CLK_PER1_C2_Prescaler_TypeDef;

#define IS_RST_CLK_PER1_C2_DIV(DIV) (((DIV) == RST_CLK_PER1_PRESCALER_DIV_1) ||  \
                                     ((DIV) == RST_CLK_PER1_PRESCALER_DIV_2) ||  \
                                     ((DIV) == RST_CLK_PER1_PRESCALER_DIV_4) ||  \
                                     ((DIV) == RST_CLK_PER1_PRESCALER_DIV_8) ||  \
                                     ((DIV) == RST_CLK_PER1_PRESCALER_DIV_16) || \
                                     ((DIV) == RST_CLK_PER1_PRESCALER_DIV_32) || \
                                     ((DIV) == RST_CLK_PER1_PRESCALER_DIV_64) || \
                                     ((DIV) == RST_CLK_PER1_PRESCALER_DIV_128))

/**
 * @brief RST_CLK WWDG_C1 clock source selection constants.
 */
typedef enum {
    RST_CLK_WWDG_C1_CLK_SRC_LSI       = ((uint32_t)RST_CLK_PER1_CLOCK_WDG_C1_SEL_LSI),
    RST_CLK_WWDG_C1_CLK_SRC_LSI_DIV_2 = ((uint32_t)RST_CLK_PER1_CLOCK_WDG_C1_SEL_LSI_DIV_2),
    RST_CLK_WWDG_C1_CLK_SRC_LSE       = ((uint32_t)RST_CLK_PER1_CLOCK_WDG_C1_SEL_LSE),
    RST_CLK_WWDG_C1_CLK_SRC_LSE_DIV_2 = ((uint32_t)RST_CLK_PER1_CLOCK_WDG_C1_SEL_LSE_DIV_2)
} RST_CLK_WWDG_C1_ClockSource_TypeDef;

#define IS_RST_CLK_WWDG_C1_CLOCK_SOURCE(CLK) (((CLK) == RST_CLK_WWDG_C1_CLK_SRC_LSI) ||       \
                                              ((CLK) == RST_CLK_WWDG_C1_CLK_SRC_LSI_DIV_2) || \
                                              ((CLK) == RST_CLK_WWDG_C1_CLK_SRC_LSE) ||       \
                                              ((CLK) == RST_CLK_WWDG_C1_CLK_SRC_LSE_DIV_2))

/**
 * @brief RST_CLK WWDG_C2 clock source selection constants.
 */
typedef enum {
    RST_CLK_WWDG_C2_CLK_SRC_CPU_C1     = ((uint32_t)RST_CLK_PER1_CLOCK_WDG_C2_SEL_CPU_C1),
    RST_CLK_WWDG_C2_CLK_SRC_WWDG_C1    = ((uint32_t)RST_CLK_PER1_CLOCK_WDG_C2_SEL_PER1_C1),
    RST_CLK_WWDG_C2_CLK_SRC_PLLCPU     = ((uint32_t)RST_CLK_PER1_CLOCK_WDG_C2_SEL_PLLCPU),
    RST_CLK_WWDG_C2_CLK_SRC_HSI_C1_CLK = ((uint32_t)RST_CLK_PER1_CLOCK_WDG_C2_SEL_HSI_C1_CLK)
} RST_CLK_WWDG_C2_ClockSource_TypeDef;

#define IS_RST_CLK_WWDG_C2_CLOCK_SOURCE(CLK) (((CLK) == RST_CLK_WWDG_C2_CLK_SRC_CPU_C1) ||  \
                                              ((CLK) == RST_CLK_WWDG_C2_CLK_SRC_WWDG_C1) || \
                                              ((CLK) == RST_CLK_WWDG_C2_CLK_SRC_PLLCPU) ||  \
                                              ((CLK) == RST_CLK_WWDG_C2_CLK_SRC_HSI_C1_CLK))

/**
 * @brief RST_CLK WWDG_BRG divider constants.
 */
typedef enum {
    RST_CLK_WWDG_PRESCALER_DIV_1   = (((uint32_t)0x0) << RST_CLK_PER1_CLOCK_WDG_BRG_Pos),
    RST_CLK_WWDG_PRESCALER_DIV_2   = (((uint32_t)0x1) << RST_CLK_PER1_CLOCK_WDG_BRG_Pos),
    RST_CLK_WWDG_PRESCALER_DIV_4   = (((uint32_t)0x2) << RST_CLK_PER1_CLOCK_WDG_BRG_Pos),
    RST_CLK_WWDG_PRESCALER_DIV_8   = (((uint32_t)0x3) << RST_CLK_PER1_CLOCK_WDG_BRG_Pos),
    RST_CLK_WWDG_PRESCALER_DIV_16  = (((uint32_t)0x4) << RST_CLK_PER1_CLOCK_WDG_BRG_Pos),
    RST_CLK_WWDG_PRESCALER_DIV_32  = (((uint32_t)0x5) << RST_CLK_PER1_CLOCK_WDG_BRG_Pos),
    RST_CLK_WWDG_PRESCALER_DIV_64  = (((uint32_t)0x6) << RST_CLK_PER1_CLOCK_WDG_BRG_Pos),
    RST_CLK_WWDG_PRESCALER_DIV_128 = (((uint32_t)0x7) << RST_CLK_PER1_CLOCK_WDG_BRG_Pos)
} RST_CLK_WWDG_C2_Prescaler_TypeDef;

