piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/inc/MDR32VF0xI_rst_clk.h
#define IS_RST_CLK_WWDG_C2_DIV(DIV) (((DIV) == RST_CLK_WWDG_PRESCALER_DIV_1) ||  \
                                     ((DIV) == RST_CLK_WWDG_PRESCALER_DIV_2) ||  \
                                     ((DIV) == RST_CLK_WWDG_PRESCALER_DIV_4) ||  \
                                     ((DIV) == RST_CLK_WWDG_PRESCALER_DIV_8) ||  \
                                     ((DIV) == RST_CLK_WWDG_PRESCALER_DIV_16) || \
                                     ((DIV) == RST_CLK_WWDG_PRESCALER_DIV_32) || \
                                     ((DIV) == RST_CLK_WWDG_PRESCALER_DIV_64) || \
                                     ((DIV) == RST_CLK_WWDG_PRESCALER_DIV_128))

/**
 * @brief RST_CLK flag identifiers.
 */
typedef enum {
    RST_CLK_FLAG_HSERDY    = RST_CLK_CLOCK_STATUS_HSE_RDY,
    RST_CLK_FLAG_PLLCPURDY = RST_CLK_CLOCK_STATUS_PLL_CPU_RDY
} RST_CLK_Flags_TypeDef;

#define IS_RST_CLK_FLAG(FLAG) (((FLAG) == RST_CLK_FLAG_HSERDY) || \
                               ((FLAG) == RST_CLK_FLAG_PLLCPURDY))

/**
 * @brief RST_CLK HSI_C1_SEL divider constants for RTCHSI.
 */
typedef enum {
    RST_CLK_HSI_PRESCALER_DIV_1   = (((uint32_t)0x0) << RST_CLK_RTC_CLOCK_HSI_SEL_Pos),
    RST_CLK_HSI_PRESCALER_DIV_2   = (((uint32_t)0x8) << RST_CLK_RTC_CLOCK_HSI_SEL_Pos),
    RST_CLK_HSI_PRESCALER_DIV_4   = (((uint32_t)0x9) << RST_CLK_RTC_CLOCK_HSI_SEL_Pos),
    RST_CLK_HSI_PRESCALER_DIV_8   = (((uint32_t)0xA) << RST_CLK_RTC_CLOCK_HSI_SEL_Pos),
    RST_CLK_HSI_PRESCALER_DIV_16  = (((uint32_t)0xB) << RST_CLK_RTC_CLOCK_HSI_SEL_Pos),
    RST_CLK_HSI_PRESCALER_DIV_32  = (((uint32_t)0xC) << RST_CLK_RTC_CLOCK_HSI_SEL_Pos),
    RST_CLK_HSI_PRESCALER_DIV_64  = (((uint32_t)0xD) << RST_CLK_RTC_CLOCK_HSI_SEL_Pos),
    RST_CLK_HSI_PRESCALER_DIV_128 = (((uint32_t)0xE) << RST_CLK_RTC_CLOCK_HSI_SEL_Pos),
    RST_CLK_HSI_PRESCALER_DIV_256 = (((uint32_t)0xF) << RST_CLK_RTC_CLOCK_HSI_SEL_Pos)
} RST_CLK_HSI_C1_Prescaler_TypeDef;

#define IS_RST_CLK_HSI_CLK_DIV(DIV) (((DIV) == RST_CLK_HSI_PRESCALER_DIV_1) ||   \
                                     ((DIV) == RST_CLK_HSI_PRESCALER_DIV_2) ||   \
                                     ((DIV) == RST_CLK_HSI_PRESCALER_DIV_4) ||   \
                                     ((DIV) == RST_CLK_HSI_PRESCALER_DIV_8) ||   \
                                     ((DIV) == RST_CLK_HSI_PRESCALER_DIV_16) ||  \
                                     ((DIV) == RST_CLK_HSI_PRESCALER_DIV_32) ||  \
                                     ((DIV) == RST_CLK_HSI_PRESCALER_DIV_64) ||  \
                                     ((DIV) == RST_CLK_HSI_PRESCALER_DIV_128) || \
                                     ((DIV) == RST_CLK_HSI_PRESCALER_DIV_256))

/**
 * @brief RST_CLK HSE_C1_SEL divider constants for RTCHSE.
 */
typedef enum {
    RST_CLK_HSE_PRESCALER_DIV_1   = (((uint32_t)0x0) << RST_CLK_RTC_CLOCK_HSE_SEL_Pos),
    RST_CLK_HSE_PRESCALER_DIV_2   = (((uint32_t)0x8) << RST_CLK_RTC_CLOCK_HSE_SEL_Pos),
    RST_CLK_HSE_PRESCALER_DIV_4   = (((uint32_t)0x9) << RST_CLK_RTC_CLOCK_HSE_SEL_Pos),
    RST_CLK_HSE_PRESCALER_DIV_8   = (((uint32_t)0xA) << RST_CLK_RTC_CLOCK_HSE_SEL_Pos),
    RST_CLK_HSE_PRESCALER_DIV_16  = (((uint32_t)0xB) << RST_CLK_RTC_CLOCK_HSE_SEL_Pos),
    RST_CLK_HSE_PRESCALER_DIV_32  = (((uint32_t)0xC) << RST_CLK_RTC_CLOCK_HSE_SEL_Pos),
    RST_CLK_HSE_PRESCALER_DIV_64  = (((uint32_t)0xD) << RST_CLK_RTC_CLOCK_HSE_SEL_Pos),
    RST_CLK_HSE_PRESCALER_DIV_128 = (((uint32_t)0xE) << RST_CLK_RTC_CLOCK_HSE_SEL_Pos),
    RST_CLK_HSE_PRESCALER_DIV_256 = (((uint32_t)0xF) << RST_CLK_RTC_CLOCK_HSE_SEL_Pos)
} RST_CLK_HSE_C1_Prescaler_TypeDef;

#define IS_RST_CLK_HSE_CLK_DIV(DIV) (((DIV) == RST_CLK_HSE_PRESCALER_DIV_1) ||   \
                                     ((DIV) == RST_CLK_HSE_PRESCALER_DIV_2) ||   \
                                     ((DIV) == RST_CLK_HSE_PRESCALER_DIV_4) ||   \
                                     ((DIV) == RST_CLK_HSE_PRESCALER_DIV_8) ||   \
                                     ((DIV) == RST_CLK_HSE_PRESCALER_DIV_16) ||  \
                                     ((DIV) == RST_CLK_HSE_PRESCALER_DIV_32) ||  \
                                     ((DIV) == RST_CLK_HSE_PRESCALER_DIV_64) ||  \
                                     ((DIV) == RST_CLK_HSE_PRESCALER_DIV_128) || \
                                     ((DIV) == RST_CLK_HSE_PRESCALER_DIV_256))

#if defined(USE_MDR32F02_REV_2) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
/**
 * @brief RST_CLK DMA_DONE_STICK channels.
 */
typedef enum {
    RST_CLK_DMA_DONE_STICK_CHANNEL_UART1_TX = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK0,      /*!< UART1 TX channel. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_UART1_RX = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK1,      /*!< UART1 RX channel. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_UART2_TX = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK2,      /*!< UART2 TX channel. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_UART2_RX = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK3,      /*!< UART2 RX channel. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_SSP1_TX  = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK4,      /*!< SSP1 TX channel. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_SSP1_RX  = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK5,      /*!< SSP1 RX channel. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_CRC      = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK6,      /*!< CRC channel. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_UART3_TX = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK7,      /*!< UART3 TX channel. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_UART3_RX = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK8,      /*!< UART3 RX channel. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_TIM3     = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK9,      /*!< TIMER3 channel. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_TIM1     = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK10,     /*!< TIMER1 channel. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_TIM2     = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK11,     /*!< TIMER2 channel. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_ADCUI_I0 = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK12,     /*!< ADCUI I0 channel. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_ADCUI_V0 = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK13,     /*!< ADCUI V0 channel. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_ADCUI_I1 = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK14,     /*!< ADCUI I1 channel. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_ADCUI_V1 = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK15,     /*!< ADCUI V1 channel. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_ADCUI_I2 = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK16,     /*!< ADCUI I2 channel. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_ADCUI_V2 = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK17,     /*!< ADCUI V2 channel. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_ADCUI_I3 = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK18,     /*!< ADCUI I3 channel. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_SSP2_TX  = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK19,     /*!< SSP2 TX channel. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_SSP2_RX  = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK20,     /*!< SSP2 RX channel. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_SSP3_TX  = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK21,     /*!< SSP3 TX channel. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_SSP3_RX  = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK22,     /*!< SSP3 RX channel. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_TIM4     = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK23,     /*!< TIMER4 channel. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_UART4_TX = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK24,     /*!< UART4 TX channel. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_UART4_RX = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK25,     /*!< UART4 RX channel. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_SW1      = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK26,     /*!< Software channel 1. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_SW2      = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK27,     /*!< Software channel 2. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_SW3      = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK28,     /*!< Software channel 3. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_SW4      = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK29,     /*!< Software channel 4. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_ADC      = RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK30,     /*!< ADC channel. */
    RST_CLK_DMA_DONE_STICK_CHANNEL_SW5      = (int)RST_CLK_DMA_DONE_STICK_DMA_DONE_STICK31 /*!< Software channel 5. */
} RST_CLK_DMADoneStickChannels_TypeDef;

#define IS_RST_CLK_DMA_DONE_STICK_CHANNEL(CH) (((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_UART1_TX) || \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_UART1_RX) || \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_UART2_TX) || \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_UART2_RX) || \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_SSP1_TX) ||  \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_SSP1_RX) ||  \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_CRC) ||      \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_UART3_TX) || \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_UART3_RX) || \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_TIM3) ||     \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_TIM1) ||     \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_TIM2) ||     \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_ADCUI_I0) || \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_ADCUI_V0) || \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_ADCUI_I1) || \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_ADCUI_V1) || \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_ADCUI_I2) || \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_ADCUI_V2) || \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_ADCUI_I3) || \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_SSP2_TX) ||  \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_SSP2_RX) ||  \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_SSP3_TX) ||  \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_SSP3_RX) ||  \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_TIM4) ||     \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_UART4_TX) || \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_UART4_RX) || \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_SW1) ||      \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_SW2) ||      \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_SW3) ||      \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_SW4) ||      \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_ADC) ||      \
                                               ((CH) == RST_CLK_DMA_DONE_STICK_CHANNEL_SW5))
#endif

/**
 * @brief RST_CLK on-chip peripheral clock frequencies.
 */
typedef enum {
    RST_CLK_CLOCK_FREQ_CPU_CLK       = ((uint32_t)0x1 << 0),  /*!< CPU clock frequency. */
    RST_CLK_CLOCK_FREQ_UART1         = ((uint32_t)0x1 << 1),  /*!< UART1 clock frequency. */
    RST_CLK_CLOCK_FREQ_UART2         = ((uint32_t)0x1 << 2),  /*!< UART2 clock frequency. */
    RST_CLK_CLOCK_FREQ_UART3         = ((uint32_t)0x1 << 3),  /*!< UART3 clock frequency. */
    RST_CLK_CLOCK_FREQ_UART4         = ((uint32_t)0x1 << 4),  /*!< UART4 clock frequency. */
    RST_CLK_CLOCK_FREQ_TIMER1        = ((uint32_t)0x1 << 5),  /*!< TIMER1 clock frequency. */
    RST_CLK_CLOCK_FREQ_TIMER2        = ((uint32_t)0x1 << 6),  /*!< TIMER2 clock frequency. */
    RST_CLK_CLOCK_FREQ_TIMER3        = ((uint32_t)0x1 << 7),  /*!< TIMER3 clock frequency. */
    RST_CLK_CLOCK_FREQ_TIMER4        = ((uint32_t)0x1 << 8),  /*!< TIMER4 clock frequency. */
    RST_CLK_CLOCK_FREQ_SSP1          = ((uint32_t)0x1 << 9),  /*!< SSP1 clock frequency. */
    RST_CLK_CLOCK_FREQ_SSP2          = ((uint32_t)0x1 << 10), /*!< SSP2 clock frequency. */
    RST_CLK_CLOCK_FREQ_SSP3          = ((uint32_t)0x1 << 11), /*!< SSP3 clock frequency. */
    RST_CLK_CLOCK_FREQ_WWDG          = ((uint32_t)0x1 << 12), /*!< WWDG clock frequency. */
    RST_CLK_CLOCK_FREQ_ADC           = ((uint32_t)0x1 << 13), /*!< ADC clock frequency. */
    RST_CLK_CLOCK_FREQ_ADCUI         = ((uint32_t)0x1 << 14), /*!< ADCUI clock frequency. */
    RST_CLK_CLOCK_FREQ_RTCHSI        = ((uint32_t)0x1 << 15), /*!< RTCHSI clock frequency. */
    RST_CLK_CLOCK_FREQ_RTCHSE        = ((uint32_t)0x1 << 16), /*!< RTCHSE clock frequency. */
    RST_CLK_CLOCK_FREQ_MACHINE_TIMER = ((uint32_t)0x1 << 17), /*!< Machine timer clock frequency. */
    RST_CLK_CLOCK_FREQ_ALL           = ((uint32_t)0x3FFFF)    /*!< Select all clock frequencies. */
} RST_CLK_Frequencies_TypeDef;

#define IS_RST_CLK_CLOCK_FREQUENCY(CLK_FREQ) (((CLK_FREQ) & ~(uint32_t)(RST_CLK_CLOCK_FREQ_ALL)) == 0x0)

/**
 * @brief Structure type for peripheral clock frequencies in Hz.
 */
typedef struct {
    uint32_t CPU_CLK_Frequency;      /*!< CPU_CLK frequency. */
    uint32_t UART_Frequency[4];      /*!< UART frequencies. */
    uint32_t TIMER_Frequency[4];     /*!< TIMER frequencies . */
    uint32_t SSP_Frequency[3];       /*!< SSP frequencies . */
    uint32_t WWDG_Frequency;         /*!< WWDG frequency. */
    uint32_t ADC_Frequency;          /*!< ADC frequency. */
    uint32_t ADCUI_Frequency;        /*!< ADCUI frequency. */
    uint32_t RTCHSI_Frequency;       /*!< HSI_RTC frequency. */
    uint32_t RTCHSE_Frequency;       /*!< HSE_RTC frequency. */
    uint32_t MachineTimer_Frequency; /*!< Core machine timer frequency. */
} RST_CLK_Freq_TypeDef;

/**
 * @brief RST_CLK HCLK clock init struct definition.
 */
typedef struct {
    RST_CLK_CPU_C1_ClockSource_TypeDef RST_CLK_CPU_C1_Source;      /*!< CPU_C1 clock source selection.
                                                                        Not used if (RSC_CLK_PLLCPU_ClockSource == RST_CLK_PLLCPU_CLK_SRC_HSE)).
                                                                        This parameter can be a value of the @ref RST_CLK_CPU_C1_ClockSource_TypeDef. */
    RST_CLK_PLLCPU_ClockSource_TypeDef RST_CLK_PLLCPU_ClockSource; /*!< CPU_PLL clock source selection.
                                                                        Not used if (RST_CLK_CPU_C2_ClockSource == RST_CLK_CPU_C2_CLK_SRC_CPU_C1).
                                                                        This parameter can be a value of the @ref RST_CLK_PLLCPU_ClockSource_TypeDef. */
    RST_CLK_PLLCPU_Multiplier_TypeDef RST_CLK_PLLCPU_Multiplier;   /*!< CPU_PLL clock multiplier selection.
                                                                        Not used if (RST_CLK_CPU_C2_ClockSource == RST_CLK_CPU_C2_CLK_SRC_CPU_C1).
                                                                        This parameter can be a value of the @ref RST_CLK_PLLCPU_Multiplier_TypeDef. */
    RST_CLK_CPU_C2_ClockSource_TypeDef RST_CLK_CPU_C2_ClockSource; /*!< CPU_C2 clock source selection.
                                                                        This parameter can be a value of the @ref RST_CLK_CPU_C2_ClockSource_TypeDef. */
    RST_CLK_CPU_C3_Prescaler_TypeDef RST_CLK_CPU_C3_Prescaler;     /*!< CPU_C3 clock divider.
                                                                        This parameter can be a value of the @ref RST_CLK_CPU_C3_Prescaler_TypeDef. */
    RST_CLK_HCLK_ClockSource_TypeDef RST_CLK_HCLK_ClockSource;     /*!< HCLK clock source selection.
                                                                        All other fields are not used if (RST_CLK_HCLK_ClockSource != RST_CLK_CPU_HCLK_CLK_SRC_CPU_C3).
                                                                        This parameter can be a value of the @ref RST_CLK_HCLK_ClockSource_TypeDef. */
} RST_CLK_HCLK_InitTypeDef;

