piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/inc/MDR32VF0xI_rst_clk.h
/** @} */ /* End of the group RST_CLK_Exported_Types */

/** @defgroup RST_CLK_Exported_Defines RST_CLK Exported Defines
 * @{
 */

#if defined(USE_MDR32F02_REV_2) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
#define IS_RST_CLK_DIV_SYS_TIM(DIV) (((DIV) >= 2) && ((DIV) <= 257))
#endif

/** @} */ /* End of the group RST_CLK_Exported_Defines */

/** @defgroup RST_CLK_Exported_Functions RST_CLK Exported Functions
 * @{
 */

void RST_CLK_DeInit(void);

ErrorStatus RST_CLK_HCLK_Init(const RST_CLK_HCLK_InitTypeDef* RST_CLK_HCLK_InitStruct);
void        RST_CLK_HCLK_StructInit(RST_CLK_HCLK_InitTypeDef* RST_CLK_HCLK_InitStruct);

void                     RST_CLK_HSE_Cmd(FunctionalState NewState);
void                     RST_CLK_HSE_Config(RST_CLK_HSE_Mode_TypeDef HSE_Mode);
RST_CLK_HSE_Mode_TypeDef RST_CLK_HSE_GetModeConfig(void);
ErrorStatus              RST_CLK_HSE_GetStatus(void);

void            RST_CLK_CPU_PLL_Config(RST_CLK_PLLCPU_ClockSource_TypeDef PLLCPU_Source, uint32_t PLLCPU_Multiplier);
void            RST_CLK_CPU_PLL_Cmd(FunctionalState NewState);
FunctionalState RST_CLK_CPU_PLL_GetCmdState(void);
ErrorStatus     RST_CLK_CPU_PLL_GetStatus(void);

void RST_CLK_CPU_C1_ClkSelection(RST_CLK_CPU_C1_ClockSource_TypeDef CPU_C1_Source);
void RST_CLK_CPU_C2_ClkSelection(RST_CLK_CPU_C2_ClockSource_TypeDef CPU_C2_Source);
void RST_CLK_CPU_C3_SetPrescaler(RST_CLK_CPU_C3_Prescaler_TypeDef CPU_CLK_DivValue);
void RST_CLK_HCLK_ClkSelection(RST_CLK_HCLK_ClockSource_TypeDef CPU_HCLK_Source);

void            RST_CLK_ADC_ClkSelection(RST_CLK_ADC_ClockSource_TypeDef ADC_CLK_Source);
void            RST_CLK_ADC_SetPrescaler(RST_CLK_ADC_C3_Prescaler_TypeDef ADC_CLK_DivValue);
void            RST_CLK_ADC_ClkCmd(FunctionalState NewState);
FunctionalState RST_CLK_ADC_GetClkCmdState(void);

void            RST_CLK_ADCUI_ClkDeInit(void);
void            RST_CLK_ADCUI_ClkSelection(RST_CLK_ADCUI_ClockSource_TypeDef ADCUI_CLK_C1_Source);
void            RST_CLK_ADCUI_SetPrescaler(RST_CLK_ADCUI_C3_Prescaler_TypeDef ADCUI_CLK_DivValue);
void            RST_CLK_ADCUI_ClkCmd(FunctionalState NewState);
FunctionalState RST_CLK_ADCUI_GetClkCmdState(void);

void            RST_CLK_HSI_C1_SetPrescaler(RST_CLK_HSI_C1_Prescaler_TypeDef HSI_CLK_DivValue);
void            RST_CLK_RTC_HSI_ClkCmd(FunctionalState NewState);
FunctionalState RST_CLK_RTC_HSI_GetClkCmdState(void);

void            RST_CLK_HSE_C1_SetPrescaler(RST_CLK_HSE_C1_Prescaler_TypeDef HSE_CLK_DivValue);
void            RST_CLK_RTC_HSE_ClkCmd(FunctionalState NewState);
FunctionalState RST_CLK_RTC_HSE_GetClkCmdState(void);

void RST_CLK_PER1_C1_ClkSelection(RST_CLK_PER1_C1_ClockSource_TypeDef PER1_C1_Source);
void RST_CLK_PER1_C2_ClkSelection(RST_CLK_PER1_C2_ClockSource_TypeDef PER1_C2_Source);

void            RST_CLK_PER1_C2_SetPrescaler(RST_CLK_PER1_C2_X_TypeDef PER1_CLK, RST_CLK_PER1_C2_Prescaler_TypeDef PER1_C2_DivValue);
void            RST_CLK_PER1_C2_Cmd(uint32_t PER1_CLK, FunctionalState NewState);
FunctionalState RST_CLK_PER1_C2_GetCmdState(RST_CLK_PER1_C2_X_TypeDef PER1_CLK);

void RST_CLK_WWDG_C1_ClkSelection(RST_CLK_WWDG_C1_ClockSource_TypeDef WWDG_C1_Source);
void RST_CLK_WWDG_C2_ClkSelection(RST_CLK_WWDG_C2_ClockSource_TypeDef WWDG_C2_Source);

void            RST_CLK_WWDG_C2_SetPrescaler(RST_CLK_WWDG_C2_Prescaler_TypeDef WWDG_C2_DivValue);
void            RST_CLK_WWDG_C2_Cmd(FunctionalState NewState);
FunctionalState RST_CLK_WWDG_C2_GetCmdState(void);

void            RST_CLK_DMACmd(FunctionalState NewState);
FunctionalState RST_CLK_GetDMACmdState(void);

void            RST_CLK_ResetKeyRAM_Cmd(FunctionalState NewState);
FunctionalState RST_CLK_GetResetKeyRAMCmdState(void);

#if defined(USE_MDR32F02_REV_2) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
FlagStatus RST_CLK_DMADone_GetFlagStatus(RST_CLK_DMADoneStickChannels_TypeDef Channel);
uint32_t   RST_CLK_DMADone_GetStatus(void);
void       RST_CLK_DMADone_ClearFlags(uint32_t Channels);

void     RST_CLK_SystemTimer_SetPrescaler(uint16_t SysTimDivValue);
uint16_t RST_CLK_SystemTimer_GetPrescaler(void);
#endif

void            RST_CLK_PCLKCmd(uint32_t RST_CLK_PCLK, FunctionalState NewState);
FunctionalState RST_CLK_GetPCLKCmdState(RST_CLK_PCLK_TypeDef RST_CLK_PCLK);

FlagStatus RST_CLK_GetFlagStatus(RST_CLK_Flags_TypeDef RST_CLK_Flag);

void RST_CLK_GetClocksFreq(RST_CLK_Freq_TypeDef* RST_CLK_Clocks, uint32_t Clocks);

/** @} */ /* End of the group RST_CLK_Exported_Functions */

/** @} */ /* End of the group RST_CLK */

/** @} */ /* End of the group MDR32VF0xI_StdPeriph_Driver */

#ifdef __cplusplus
} // extern "C" block end
#endif

#endif /* MDR32VF0xI_RST_CLK_H */

/*********************** (C) COPYRIGHT 2025 Milandr ****************************
 *
 * END OF FILE MDR32VF0xI_rst_clk.h */

